/*******************************************************************************
 * Robofuture RM Team
 * File name: bsp_init.c
 * Author: Zhb        Version: 1.0        Date: 2021/3/12
 * Description: 针对开发板初始化BSP各个模块
 * Function List:
 *   1. BSP_Init 初始化BSP各模块
 * History:
 *      <author> <time>  <version > <desc>
 *        Zhb   21/03/12  1.0       首次提交
*******************************************************************************/

/* 包含头文件 ----------------------------------------------------------------*/
#include "bsp_init.h"
/* 私有类型定义 --------------------------------------------------------------*/

/* 私有宏定义 ----------------------------------------------------------------*/
#define COM1_TX_BUFFER_SIZE (512)       //512    //100      //底盘512档    //云台100档     //信息缓存影响速率
#define COM1_TX_FIFO_SIZE   (1024)       //1024   //300    
#define COM1_RX_BUFFER_SIZE (512)        //512    //38

/* 私有变量 ------------------------------------------------------------------*/
uint8_t com1_tx_buffer[COM1_TX_BUFFER_SIZE];
uint8_t com1_tx_fifo_buffer[COM1_TX_FIFO_SIZE];
uint8_t com1_rx_buffer[COM1_RX_BUFFER_SIZE];
/* 全局变量 ------------------------------------------------------------------*/
/* IO对象结构 */

/* 串口对象结构 */
UART_Object_t com1_obj;  //这里名字使用板子上丝印


/* 扩展变量 ------------------------------------------------------------------*/

/* 私有函数原形 --------------------------------------------------------------*/

/* 函数体 --------------------------------------------------------------------*/


/*************************************************
 * Function: BSP_Init
 * Description: BSP初始化
 * Input: 无
 * Return: 无
*************************************************/
void BSP_Init(void)
{
    BSP_DelayInit();
    BSP_UART_NewObject(&com1_obj, &huart1);
    BSP_UART_TransmitConfig(&com1_obj, com1_tx_buffer, COM1_TX_BUFFER_SIZE, com1_tx_fifo_buffer, COM1_TX_FIFO_SIZE);
}
